// Завдання 4 На рахунку користувача є 23580 кредитів, значення яких зберігається в

// змінній credits (створи зміну та присвой). Користувач вирішує купити телевізори,
// які коштують по 3000 кредитів за штуку. Ціна одного телевізора зберігається в

// змінній pricePerDroid (створи та присвой).
// При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість

// телевізорів, які користувач хоче купити і зберегти в змінну.
// Напишіть скрипт, який:
// Якщо в prompt була натиснута кнопка Cancel, виведе повідомлення в консоль

// «Операцію скасовано!» У протилежному випадку розраховує загальну ціну замовлення

// та зберігає в змінній totalPrice. Перевіряє, чи зможе користувач оплатити

// замовлення: якщо сума до оплати перевищує кількість кредитів на рахунок, виводе

// в консоль повідомлення 'Недостатньо коштів на рахунку!'. в іншому випадку

// Необхідно підрахувати залишок кредитів на рахунку та вивести повідомлення «Ви

// купили [кількість] телевізорів, на рахунку залишилось [число] кредитів.'.

let credits = 23580;
let pricePerDroid = 3000;

let value = prompt("Скільки бажаєте придбати телевізорів", "");

let totalValue = value * pricePerDroid;
let restCredits = credits - totalValue;

if (value === "" || value === null) {
  alert("Операцію скасовано!");
}

if (credits >= totalValue) {
  alert(
    `Ви купили ${value} телевізорів, на рахунку залишилось ${restCredits}  кредитів.`
  );
} else {
  alert("Недостатньо коштів на рахунку!");
}
